; ModuleID = 'pure-ftpd.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._code = type { i8*, i32 }
%struct.AuthResult_ = type { i32, i32, i32, i8*, i32, i8* }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct.__sigset_t = type { [16 x i64] }
%struct.reply = type { %struct.reply*, [1 x i8] }
%struct.Authentications_ = type { %struct.Authentication_*, i8*, %struct.Authentications_* }
%struct.Authentication_ = type { i8*, void (i8*)*, void (%struct.AuthResult_*, i8*, i8*, %struct.sockaddr_storage*, %struct.sockaddr_storage*)*, void ()* }
%struct.SimpleConfEntry_ = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.userid = type { %struct.userid*, i32, i8* }
%struct.groupid = type { %struct.groupid*, i32, i8* }
%struct.filename = type { %struct.filename*, %struct.filename*, i32, [1 x i8] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rng_state = type { i32, i32, i64, [32 x i8], [512 x i8] }
%struct.DirAlias_ = type { i8*, i8*, %struct.DirAlias_* }

!250 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184, isUnsigned: true)
!251 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185, isUnsigned: true)
!252 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186, isUnsigned: true)
!253 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187, isUnsigned: true)
!254 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188, isUnsigned: true)
!255 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189, isUnsigned: true)
!256 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190, isUnsigned: true)
!257 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191, isUnsigned: true)
!258 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192, isUnsigned: true)
!259 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193, isUnsigned: true)
!260 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194, isUnsigned: true)
!261 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195, isUnsigned: true)
!262 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196, isUnsigned: true)
!263 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197, isUnsigned: true)
!264 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198, isUnsigned: true)
!265 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199, isUnsigned: true)
!266 = !DIEnumerator(name: "_SC_IPV6", value: 235, isUnsigned: true)
!267 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236, isUnsigned: true)
!268 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237, isUnsigned: true)
!269 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238, isUnsigned: true)
!270 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239, isUnsigned: true)
!271 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240, isUnsigned: true)
!272 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241, isUnsigned: true)
!273 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242, isUnsigned: true)
!274 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243, isUnsigned: true)
!275 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244, isUnsigned: true)
!276 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245, isUnsigned: true)
!277 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246, isUnsigned: true)
!278 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247, isUnsigned: true)
!279 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !281, line: 31, baseType: !7, size: 32, elements: !282)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/resource.h", directory: "")
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301}
!283 = !DIEnumerator(name: "RLIMIT_CPU", value: 0, isUnsigned: true)
!284 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "RLIMIT_DATA", value: 2, isUnsigned: true)
!286 = !DIEnumerator(name: "RLIMIT_STACK", value: 3, isUnsigned: true)
!287 = !DIEnumerator(name: "RLIMIT_CORE", value: 4, isUnsigned: true)
!288 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5, isUnsigned: true)
!289 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7, isUnsigned: true)
!290 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7, isUnsigned: true)
!291 = !DIEnumerator(name: "RLIMIT_AS", value: 9, isUnsigned: true)
!292 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6, isUnsigned: true)
!293 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8, isUnsigned: true)
!294 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10, isUnsigned: true)
!295 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11, isUnsigned: true)
!296 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12, isUnsigned: true)
!297 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13, isUnsigned: true)
!298 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14, isUnsigned: true)
!299 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15, isUnsigned: true)
!300 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16, isUnsigned: true)
!301 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16, isUnsigned: true)
!302 = !{!303, !304, !307, !308, !310, !314, !326, !321, !7, !327, !330, !335, !336, !331, !337, !306, !340, !343, !344, !347, !348, !350, !359, !361, !382, !383, !385, !387, !392, !334, !394, !396, !397}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !305, line: 46, baseType: !306)
!305 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!306 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!307 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !311, line: 274, baseType: !312)
!311 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !313, line: 209, baseType: !7)
!313 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !316, line: 178, size: 128, elements: !317)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!317 = !{!318, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !315, file: !316, line: 180, baseType: !319, size: 16)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !320, line: 28, baseType: !321)
!320 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!321 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !315, file: !316, line: 181, baseType: !323, size: 112, offset: 16)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 112, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 14)
!326 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !328, line: 26, baseType: !329)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !313, line: 42, baseType: !7)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !332, line: 7, baseType: !333)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !313, line: 160, baseType: !334)
!334 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!335 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!336 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !338, line: 79, baseType: !339)
!338 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !313, line: 146, baseType: !7)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !34, line: 119, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !328, line: 25, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !313, line: 40, baseType: !321)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !34, line: 30, baseType: !327)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !345, line: 63, baseType: !346)
!345 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !313, line: 152, baseType: !334)
!347 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !338, line: 69, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !313, line: 150, baseType: !7)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reply", file: !352, line: 57, size: 128, elements: !353)
!352 = !DIFile(filename: "./ftpd_p.h", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !351, file: !352, line: 58, baseType: !350, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !351, file: !352, line: 59, baseType: !356, size: 8, offset: 64)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 8, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 1)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !338, line: 64, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !313, line: 147, baseType: !7)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !34, line: 212, size: 128, elements: !364)
!364 = !{!365}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !363, file: !34, line: 219, baseType: !366, size: 128)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !34, line: 214, size: 128, elements: !367)
!367 = !{!368, !374, !378}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !366, file: !34, line: 216, baseType: !369, size: 128)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 128, elements: !372)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !328, line: 24, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !313, line: 38, baseType: !307)
!372 = !{!373}
!373 = !DISubrange(count: 16)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !366, file: !34, line: 217, baseType: !375, size: 128)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 128, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 8)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !366, file: !34, line: 218, baseType: !379, size: 128)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 128, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 4)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !345, line: 77, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !313, line: 193, baseType: !334)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !388, line: 72, baseType: !389)
!388 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !326}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !338, line: 97, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !313, line: 154, baseType: !326)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !395, line: 49, baseType: !334)
!395 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "")
!396 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!399 = !{!0, !400, !411, !417, !419, !421, !423, !426, !428, !430, !432, !434, !436, !438, !440, !442, !444, !446, !448, !451, !453, !455, !457, !459, !464, !466, !472, !479, !483, !488, !496, !498, !508, !510, !512, !562, !564, !566, !568, !570, !572, !574, !577, !580, !585, !587, !589, !591, !593, !595, !597, !599, !604, !609, !611, !613, !618, !620, !622, !624, !626, !628, !630, !632, !634, !636, !638, !640, !642, !644, !646, !648, !650, !652, !657, !659, !661, !663, !665, !667, !669, !671, !673, !675, !677, !679, !681, !683, !685, !687, !689, !691, !693, !695, !697, !699, !701, !703, !705, !707, !709, !711, !713, !715, !717, !722, !724, !726, !736, !744, !752, !755, !761, !763, !765, !778, !780, !793, !795, !800, !805}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "facilitynames", scope: !2, file: !402, line: 122, type: !403, isLocal: false, isDefinition: true)
!402 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/syslog.h", directory: "")
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 2944, elements: !409)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "CODE", file: !402, line: 72, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_code", file: !402, line: 69, size: 128, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "c_name", scope: !405, file: !402, line: 70, baseType: !308, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "c_val", scope: !405, file: !402, line: 71, baseType: !326, size: 32, offset: 64)
!409 = !{!410}
!410 = !DISubrange(count: 23)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "default_tz_for_putenv", scope: !2, file: !413, line: 12, type: !414, isLocal: false, isDefinition: true)
!413 = !DIFile(filename: "./globals.h", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 104, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 13)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "fd_inputFile", scope: !2, file: !413, line: 25, type: !326, isLocal: false, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "clientfd", scope: !2, file: !413, line: 32, type: !326, isLocal: false, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "datafd", scope: !2, file: !413, line: 33, type: !326, isLocal: false, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "cmdsize", scope: !2, file: !413, line: 38, type: !425, isLocal: false, isDefinition: true)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "noopidle", scope: !2, file: !413, line: 58, type: !331, isLocal: false, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "firstport", scope: !2, file: !413, line: 59, type: !7, isLocal: false, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "lastport", scope: !2, file: !413, line: 60, type: !7, isLocal: false, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "dot_write_ok", scope: !2, file: !413, line: 61, type: !396, isLocal: false, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "dot_read_ok", scope: !2, file: !413, line: 62, type: !396, isLocal: false, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "type", scope: !2, file: !413, line: 66, type: !396, isLocal: false, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "idletime", scope: !2, file: !413, line: 78, type: !306, isLocal: false, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "resolve_hostnames", scope: !2, file: !413, line: 80, type: !396, isLocal: false, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "max_ls_files", scope: !2, file: !413, line: 82, type: !7, isLocal: false, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "max_ls_depth", scope: !2, file: !413, line: 83, type: !7, isLocal: false, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "maxusers", scope: !2, file: !413, line: 93, type: !7, isLocal: false, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "xferfd", scope: !2, file: !413, line: 100, type: !450, isLocal: false, isDefinition: true)
!450 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !326)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "u_mask", scope: !2, file: !413, line: 113, type: !348, isLocal: false, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "u_mask_d", scope: !2, file: !413, line: 114, type: !348, isLocal: false, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "state_needs_update", scope: !2, file: !413, line: 115, type: !396, isLocal: false, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "syslog_facility", scope: !2, file: !413, line: 117, type: !326, isLocal: false, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "months", scope: !2, file: !413, line: 161, type: !461, isLocal: false, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 768, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 12)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "pid_file", scope: !2, file: !413, line: 172, type: !385, isLocal: false, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "tapping", scope: !468, file: !3, line: 1695, type: !7, isLocal: true, isDefinition: true)
!468 = distinct !DISubprogram(name: "dopass", scope: !3, file: !3, line: 1693, type: !469, scopeLine: 1694, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !308}
!471 = !{}
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "root_st_dev", scope: !474, file: !3, line: 2546, type: !477, isLocal: true, isDefinition: true)
!474 = distinct !DISubprogram(name: "dochmod", scope: !3, file: !3, line: 2544, type: !475, scopeLine: 2545, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !471)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !308, !348}
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !338, line: 59, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !313, line: 145, baseType: !306)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "root_st_ino", scope: !474, file: !3, line: 2547, type: !481, isLocal: true, isDefinition: true)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !338, line: 47, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !313, line: 148, baseType: !306)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "seq", scope: !485, file: !3, line: 3594, type: !7, isLocal: true, isDefinition: true)
!485 = distinct !DISubprogram(name: "dostou", scope: !3, file: !3, line: 3591, type: !486, scopeLine: 3592, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !471)
!486 = !DISubroutineType(types: !487)
!487 = !{null}
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "_A", scope: !490, file: !3, line: 6270, type: !494, isLocal: true, isDefinition: true)
!490 = distinct !DISubprogram(name: "pureftpd_start", scope: !3, file: !3, line: 5524, type: !491, scopeLine: 5525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !471)
!491 = !DISubroutineType(types: !492)
!492 = !{!326, !326, !493, !385}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !309)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "standalone_ip", scope: !2, file: !352, line: 51, type: !385, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "old_sigmask", scope: !2, file: !352, line: 222, type: !500, isLocal: true, isDefinition: true)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !501, line: 7, baseType: !502)
!501 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sigset_t.h", directory: "")
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !503, line: 8, baseType: !504)
!503 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 5, size: 1024, elements: !505)
!505 = !{!506}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !504, file: !503, line: 7, baseType: !507, size: 1024)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 1024, elements: !372)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "argv0", scope: !2, file: !352, line: 226, type: !493, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "argv_lth", scope: !2, file: !352, line: 227, type: !304, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "first_authentications", scope: !2, file: !352, line: 287, type: !514, isLocal: true, isDefinition: true)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "Authentications", file: !352, line: 285, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Authentications_", file: !352, line: 281, size: 192, elements: !517)
!517 = !{!518, !559, !560}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "auth", scope: !516, file: !352, line: 282, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "Authentication", file: !352, line: 250, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Authentication_", file: !352, line: 242, size: 256, elements: !523)
!523 = !{!524, !525, !530, !557}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !522, file: !352, line: 243, baseType: !385, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !522, file: !352, line: 244, baseType: !526, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !529}
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !522, file: !352, line: 245, baseType: !531, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !534, !385, !385, !546, !546}
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "AuthResult", file: !537, line: 294, baseType: !538)
!537 = !DIFile(filename: "./ftpd.h", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AuthResult_", file: !537, line: 266, size: 320, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "auth_ok", scope: !538, file: !537, line: 267, baseType: !326, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !538, file: !537, line: 268, baseType: !337, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !538, file: !537, line: 269, baseType: !359, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !538, file: !537, line: 270, baseType: !385, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "slow_tilde_expansion", scope: !538, file: !537, line: 271, baseType: !326, size: 32, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "backend_data", scope: !538, file: !537, line: 272, baseType: !303, size: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !316, line: 191, size: 1024, elements: !550)
!550 = !{!551, !552, !556}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !549, file: !316, line: 193, baseType: !319, size: 16)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !549, file: !316, line: 194, baseType: !553, size: 944, offset: 16)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 944, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 118)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !549, file: !316, line: 195, baseType: !306, size: 64, offset: 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !522, file: !352, line: 249, baseType: !558, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "conf_file", scope: !516, file: !352, line: 283, baseType: !308, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !516, file: !352, line: 284, baseType: !561, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "last_authentications", scope: !2, file: !352, line: 287, type: !514, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "firstreply", scope: !2, file: !352, line: 353, type: !350, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "lastreply", scope: !2, file: !352, line: 354, type: !350, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "downloaded", scope: !2, file: !413, line: 13, type: !335, isLocal: false, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "uploaded", scope: !2, file: !413, line: 14, type: !335, isLocal: false, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "anon_only", scope: !2, file: !413, line: 15, type: !396, isLocal: false, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "trustedip", scope: !2, file: !413, line: 16, type: !576, isLocal: false, isDefinition: true)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "logging", scope: !2, file: !413, line: 17, type: !579, isLocal: false, isDefinition: true)
!579 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !396)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "inputFile", scope: !2, file: !413, line: 26, type: !582, isLocal: false, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 8192, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 1024)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "throttling_bandwidth_dl", scope: !2, file: !413, line: 28, type: !306, isLocal: false, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "throttling_bandwidth_ul", scope: !2, file: !413, line: 29, type: !306, isLocal: false, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "allowfxp", scope: !2, file: !413, line: 30, type: !396, isLocal: false, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "passive", scope: !2, file: !413, line: 31, type: !396, isLocal: false, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "ctrlconn", scope: !2, file: !413, line: 34, type: !549, isLocal: false, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "v6ready", scope: !2, file: !413, line: 36, type: !396, isLocal: false, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "no_ipv4", scope: !2, file: !413, line: 37, type: !396, isLocal: false, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "cmd", scope: !2, file: !413, line: 39, type: !601, isLocal: false, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 33024, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 4128)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "wd", scope: !2, file: !413, line: 40, type: !606, isLocal: false, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 32776, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 4097)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "root_directory", scope: !2, file: !413, line: 41, type: !308, isLocal: false, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "loggedin", scope: !2, file: !413, line: 42, type: !396, isLocal: false, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "account", scope: !2, file: !413, line: 43, type: !615, isLocal: false, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 1024, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 128)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "renamefrom", scope: !2, file: !413, line: 44, type: !308, isLocal: false, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "serverport", scope: !2, file: !413, line: 45, type: !340, isLocal: false, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "userchroot", scope: !2, file: !413, line: 46, type: !396, isLocal: false, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "chrooted", scope: !2, file: !413, line: 49, type: !396, isLocal: false, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "chroot_trustedgid", scope: !2, file: !413, line: 50, type: !337, isLocal: false, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "broken_client_compat", scope: !2, file: !413, line: 51, type: !396, isLocal: false, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "warez", scope: !2, file: !413, line: 52, type: !337, isLocal: false, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !413, line: 53, type: !396, isLocal: false, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "guest", scope: !2, file: !413, line: 54, type: !396, isLocal: false, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "useruid", scope: !2, file: !413, line: 55, type: !337, isLocal: false, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "candownload", scope: !2, file: !413, line: 56, type: !396, isLocal: false, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "load", scope: !2, file: !413, line: 57, type: !336, isLocal: false, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "dot_read_anon_ok", scope: !2, file: !413, line: 63, type: !396, isLocal: false, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "restartat", scope: !2, file: !413, line: 77, type: !344, isLocal: false, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "idletime_noop", scope: !2, file: !413, line: 79, type: !336, isLocal: false, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "allow_anon_mkdir", scope: !2, file: !413, line: 81, type: !326, isLocal: false, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "fortunes_file", scope: !2, file: !413, line: 84, type: !308, isLocal: false, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "host", scope: !2, file: !413, line: 85, type: !654, isLocal: false, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 8200, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 1025)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "replycode", scope: !2, file: !413, line: 86, type: !326, isLocal: false, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "force_ls_a", scope: !2, file: !413, line: 87, type: !396, isLocal: false, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "peer", scope: !2, file: !413, line: 88, type: !549, isLocal: false, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "force_passive_ip", scope: !2, file: !413, line: 89, type: !549, isLocal: false, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "force_passive_ip_s", scope: !2, file: !413, line: 90, type: !385, isLocal: false, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "peerdataport", scope: !2, file: !413, line: 91, type: !340, isLocal: false, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "maxload", scope: !2, file: !413, line: 92, type: !336, isLocal: false, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "maxip", scope: !2, file: !413, line: 103, type: !7, isLocal: false, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "standalone", scope: !2, file: !413, line: 107, type: !396, isLocal: false, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "epsv_all", scope: !2, file: !413, line: 110, type: !396, isLocal: false, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "maxdiskusagepct", scope: !2, file: !413, line: 111, type: !336, isLocal: false, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "disallow_passive", scope: !2, file: !413, line: 112, type: !396, isLocal: false, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "no_syslog", scope: !2, file: !413, line: 116, type: !396, isLocal: false, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "autorename", scope: !2, file: !413, line: 118, type: !396, isLocal: false, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "anon_noupload", scope: !2, file: !413, line: 119, type: !396, isLocal: false, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "nochmod", scope: !2, file: !413, line: 120, type: !396, isLocal: false, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "keepallfiles", scope: !2, file: !413, line: 121, type: !396, isLocal: false, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "daemonize", scope: !2, file: !413, line: 124, type: !396, isLocal: false, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "create_home", scope: !2, file: !413, line: 140, type: !396, isLocal: false, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "disallow_rename", scope: !2, file: !413, line: 141, type: !396, isLocal: false, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "no_truncate", scope: !2, file: !413, line: 142, type: !396, isLocal: false, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "page_size", scope: !2, file: !413, line: 144, type: !304, isLocal: false, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "log_pid", scope: !2, file: !413, line: 145, type: !326, isLocal: false, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "authresult", scope: !2, file: !413, line: 168, type: !536, isLocal: false, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "session_start_time", scope: !2, file: !413, line: 169, type: !331, isLocal: false, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "be_customer_proof", scope: !2, file: !413, line: 175, type: !396, isLocal: false, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "atomic_prefix", scope: !2, file: !413, line: 189, type: !308, isLocal: false, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "tls_cnx", scope: !2, file: !413, line: 192, type: !303, isLocal: false, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "tls_data_cnx", scope: !2, file: !413, line: 193, type: !303, isLocal: false, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "cwd_failures", scope: !2, file: !413, line: 201, type: !306, isLocal: false, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "replybuf", scope: !2, file: !3, line: 308, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 132672, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 16584)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "replybuf_left", scope: !2, file: !3, line: 310, type: !304, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "replybuf_pos", scope: !2, file: !3, line: 309, type: !308, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "portlist", scope: !728, file: !3, line: 2243, type: !732, isLocal: true, isDefinition: true)
!728 = distinct !DISubprogram(name: "doport3", scope: !3, file: !3, line: 2238, type: !729, scopeLine: 2239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !471)
!729 = !DISubroutineType(types: !730)
!730 = !{!326, !731}
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 160, elements: !734)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!734 = !{!735}
!735 = !DISubrange(count: 10)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "res", scope: !738, file: !3, line: 3665, type: !741, isLocal: true, isDefinition: true)
!738 = distinct !DISubprogram(name: "get_atomic_file", scope: !3, file: !3, line: 3663, type: !739, scopeLine: 3664, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !471)
!739 = !DISubroutineType(types: !740)
!740 = !{!308, !529}
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 32768, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 4096)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "name2", scope: !746, file: !3, line: 3618, type: !741, isLocal: true, isDefinition: true)
!746 = distinct !DISubprogram(name: "tryautorename", scope: !3, file: !3, line: 3615, type: !747, scopeLine: 3617, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !471)
!747 = !DISubroutineType(types: !748)
!748 = !{!326, !529, !749, !750}
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "nb_children", scope: !2, file: !352, line: 52, type: !754, isLocal: true, isDefinition: true)
!754 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "stop_server", scope: !2, file: !352, line: 49, type: !757, isLocal: true, isDefinition: true)
!757 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !759, line: 8, baseType: !760)
!759 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/sig_atomic_t.h", directory: "")
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !313, line: 214, baseType: !326)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "listenfd", scope: !2, file: !352, line: 53, type: !450, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "listenfd6", scope: !2, file: !352, line: 54, type: !450, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "simpleconf_options", scope: !2, file: !767, line: 6, type: !768, isLocal: true, isDefinition: true)
!767 = !DIFile(filename: "./simpleconf_ftpd.h", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 8320, elements: !776)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "SimpleConfEntry", file: !771, line: 9, baseType: !772)
!771 = !DIFile(filename: "./simpleconf.h", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleConfEntry_", file: !771, line: 6, size: 128, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !772, file: !771, line: 7, baseType: !385, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !772, file: !771, line: 8, baseType: !385, size: 64, offset: 64)
!776 = !{!777}
!777 = !DISubrange(count: 65)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "GETOPT_OPTIONS", scope: !2, file: !352, line: 62, type: !385, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !352, line: 109, type: !782, isLocal: true, isDefinition: true)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 12032, elements: !791)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !784, line: 50, size: 256, elements: !785)
!784 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!785 = !{!786, !787, !788, !790}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !783, file: !784, line: 52, baseType: !385, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !783, file: !784, line: 55, baseType: !326, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !783, file: !784, line: 56, baseType: !789, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !783, file: !784, line: 57, baseType: !326, size: 32, offset: 192)
!791 = !{!792}
!792 = !DISubrange(count: 47)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "standalone_port", scope: !2, file: !352, line: 50, type: !385, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "auth_list", scope: !2, file: !352, line: 252, type: !797, isLocal: true, isDefinition: true)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 512, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 2)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "old_sa", scope: !802, file: !3, line: 5331, type: !549, isLocal: true, isDefinition: true)
!802 = distinct !DISubprogram(name: "accept_client", scope: !3, file: !3, line: 5283, type: !803, scopeLine: 5283, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !471)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !731}
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "lim", scope: !807, file: !3, line: 4677, type: !808, isLocal: true, isDefinition: true)
!807 = distinct !DISubprogram(name: "fixlimits", scope: !3, file: !3, line: 4674, type: !486, scopeLine: 4675, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !471)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !281, line: 139, size: 128, elements: !809)
!809 = !{!810, !813}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !808, file: !281, line: 142, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !281, line: 131, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !313, line: 157, baseType: !306)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !808, file: !281, line: 144, baseType: !811, size: 64, offset: 64)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 1664, elements: !415)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "opt_S", scope: !817, file: !839, line: 42, type: !326, isLocal: false, isDefinition: true)
!817 = distinct !DICompileUnit(language: DW_LANG_C99, file: !818, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !819, retainedTypes: !820, globals: !836, splitDebugInlining: false, nameTableKind: None)
!818 = !DIFile(filename: "ls.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!819 = !{!5}
!820 = !{!303, !304, !326, !307, !321, !330, !309, !7, !335, !308, !383, !821}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "PureFileInfo", file: !537, line: 305, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PureFileInfo_", file: !537, line: 296, size: 448, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !834, !835}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "names_pnt", scope: !824, file: !537, line: 297, baseType: !493, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "name_offset", scope: !824, file: !537, line: 298, baseType: !304, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !824, file: !537, line: 299, baseType: !344, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !824, file: !537, line: 300, baseType: !331, size: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !824, file: !537, line: 301, baseType: !348, size: 32, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !824, file: !537, line: 302, baseType: !832, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !338, line: 74, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !313, line: 151, baseType: !306)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !824, file: !537, line: 303, baseType: !337, size: 32, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !824, file: !537, line: 304, baseType: !359, size: 32, offset: 416)
!836 = !{!837, !840, !848, !856, !858, !860, !862, !864, !866, !868, !870, !815, !872, !874, !883, !885, !887, !896}
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "matches", scope: !817, file: !839, line: 22, type: !7, isLocal: true, isDefinition: true)
!839 = !DIFile(filename: "./ls_p.h", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "user_head", scope: !817, file: !839, line: 37, type: !842, isLocal: true, isDefinition: true)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "userid", file: !839, line: 24, size: 192, elements: !844)
!844 = !{!845, !846, !847}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !843, file: !839, line: 25, baseType: !842, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !843, file: !839, line: 26, baseType: !337, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !843, file: !839, line: 27, baseType: !308, size: 64, offset: 128)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "group_head", scope: !817, file: !839, line: 38, type: !850, isLocal: true, isDefinition: true)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "groupid", file: !839, line: 30, size: 192, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !851, file: !839, line: 31, baseType: !850, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !851, file: !839, line: 32, baseType: !359, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !851, file: !839, line: 33, baseType: !308, size: 64, offset: 128)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "opt_a", scope: !817, file: !839, line: 42, type: !326, isLocal: false, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "opt_C", scope: !817, file: !839, line: 42, type: !326, isLocal: false, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "opt_d", scope: !817, file: !839, line: 42, type: !326, isLocal: false, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "opt_F", scope: !817, file: !839, line: 42, type: !326, isLocal: false, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "opt_l", scope: !817, file: !839, line: 42, type: !326, isLocal: false, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "opt_R", scope: !817, file: !839, line: 42, type: !326, isLocal: false, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "opt_r", scope: !817, file: !839, line: 42, type: !326, isLocal: false, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "opt_t", scope: !817, file: !839, line: 42, type: !326, isLocal: false, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "colwidth", scope: !817, file: !839, line: 10, type: !7, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "tail", scope: !817, file: !839, line: 21, type: !876, isLocal: true, isDefinition: true)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filename", file: !839, line: 13, size: 192, elements: !878)
!878 = !{!879, !880, !881, !882}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !877, file: !839, line: 14, baseType: !876, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !877, file: !839, line: 15, baseType: !876, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !877, file: !839, line: 16, baseType: !326, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !877, file: !839, line: 17, baseType: !356, size: 8, offset: 160)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "head", scope: !817, file: !839, line: 20, type: !876, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "filenames", scope: !817, file: !839, line: 11, type: !7, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "outbuf", scope: !889, file: !818, line: 21, type: !893, isLocal: true, isDefinition: true)
!889 = distinct !DISubprogram(name: "wrstr", scope: !818, file: !818, line: 19, type: !890, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !817, retainedNodes: !471)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !731, !892, !385}
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 524288, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 65536)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "outcnt", scope: !889, file: !818, line: 22, type: !304, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "rng_state", scope: !900, file: !901, line: 98, type: !903, isLocal: true, isDefinition: true)
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, globals: !902, splitDebugInlining: false, nameTableKind: None)
!901 = !DIFile(filename: "alt_arc4random.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!902 = !{!898}
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rng_state", file: !901, line: 90, size: 4480, elements: !904)
!904 = !{!905, !906, !907, !908, !912}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !903, file: !901, line: 91, baseType: !326, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !903, file: !901, line: 92, baseType: !326, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !903, file: !901, line: 93, baseType: !304, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !903, file: !901, line: 94, baseType: !909, size: 256, offset: 128)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 256, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "reserve", scope: !903, file: !901, line: 95, baseType: !913, size: 4096, offset: 384)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 4096, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 512)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "head", scope: !918, file: !919, line: 52, type: !924, isLocal: true, isDefinition: true)
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !920, globals: !921, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "diraliases.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!920 = !{!303}
!921 = !{!916, !922, !933}
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "tail", scope: !918, file: !919, line: 52, type: !924, isLocal: true, isDefinition: true)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirAlias", file: !926, line: 17, baseType: !927)
!926 = !DIFile(filename: "./diraliases.h", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DirAlias_", file: !926, line: 13, size: 192, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !927, file: !926, line: 14, baseType: !308, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !927, file: !926, line: 15, baseType: !308, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !927, file: !926, line: 16, baseType: !932, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "aliases_up", scope: !918, file: !919, line: 53, type: !396, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "iptrack_list", scope: !937, file: !938, line: 14, type: !951, isLocal: true, isDefinition: true)
!937 = distinct !DICompileUnit(language: DW_LANG_C99, file: !938, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !939, globals: !950, splitDebugInlining: false, nameTableKind: None)
!938 = !DIFile(filename: "dynamic.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!939 = !{!303, !392, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !34, line: 212, size: 128, elements: !943)
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !942, file: !34, line: 219, baseType: !945, size: 128)
!945 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !942, file: !34, line: 214, size: 128, elements: !946)
!946 = !{!947, !948, !949}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !945, file: !34, line: 216, baseType: !369, size: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !945, file: !34, line: 217, baseType: !375, size: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !945, file: !34, line: 218, baseType: !379, size: 128)
!950 = !{!935}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPTrack", file: !953, line: 9, baseType: !954)
!953 = !DIFile(filename: "./dynamic.h", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IPTrack_", file: !953, line: 6, size: 1088, elements: !955)
!955 = !{!956, !962}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !954, file: !953, line: 7, baseType: !957, size: 1024)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !316, line: 191, size: 1024, elements: !958)
!958 = !{!959, !960, !961}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !957, file: !316, line: 193, baseType: !319, size: 16)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !957, file: !316, line: 194, baseType: !553, size: 944, offset: 16)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !957, file: !316, line: 195, baseType: !306, size: 64, offset: 960)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !954, file: !953, line: 8, baseType: !392, size: 32, offset: 1024)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "scanned", scope: !965, file: !966, line: 60, type: !304, isLocal: true, isDefinition: true)
!965 = distinct !DICompileUnit(language: DW_LANG_C99, file: !966, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !819, retainedTypes: !967, globals: !968, splitDebugInlining: false, nameTableKind: None)
!966 = !DIFile(filename: "ftp_parser.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!967 = !{!304, !383, !307, !326, !321, !309, !335, !344, !303, !336, !348, !331, !306, !382}
!968 = !{!963, !969}
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "readnbd", scope: !965, file: !966, line: 61, type: !304, isLocal: true, isDefinition: true)
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, splitDebugInlining: false, nameTableKind: None)
!972 = !DIFile(filename: "main.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!973 = distinct !DICompileUnit(language: DW_LANG_C99, file: !974, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !975, splitDebugInlining: false, nameTableKind: None)
!974 = !DIFile(filename: "ipstack.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!975 = !{!976, !987, !989, !1005}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !34, line: 238, size: 128, elements: !978)
!978 = !{!979, !980, !981, !985}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !977, file: !34, line: 240, baseType: !319, size: 16)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !977, file: !34, line: 241, baseType: !340, size: 16, offset: 16)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !977, file: !34, line: 242, baseType: !982, size: 32, offset: 32)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !34, line: 31, size: 32, elements: !983)
!983 = !{!984}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !982, file: !34, line: 33, baseType: !343, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !977, file: !34, line: 245, baseType: !986, size: 64, offset: 64)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 64, elements: !376)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !34, line: 253, size: 224, elements: !991)
!991 = !{!992, !993, !994, !995, !1004}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !990, file: !34, line: 255, baseType: !319, size: 16)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !990, file: !34, line: 256, baseType: !340, size: 16, offset: 16)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !990, file: !34, line: 257, baseType: !327, size: 32, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !990, file: !34, line: 258, baseType: !996, size: 128, offset: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !34, line: 212, size: 128, elements: !997)
!997 = !{!998}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !996, file: !34, line: 219, baseType: !999, size: 128)
!999 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !996, file: !34, line: 214, size: 128, elements: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !999, file: !34, line: 216, baseType: !369, size: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !999, file: !34, line: 217, baseType: !375, size: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !999, file: !34, line: 218, baseType: !379, size: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !990, file: !34, line: 259, baseType: !327, size: 32, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1007 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1008, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !1009, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "log_unix.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!1009 = !{!303, !308, !385}
!1010 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1011, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !1012, splitDebugInlining: false, nameTableKind: None)
!1011 = !DIFile(filename: "safe_rw.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!1012 = !{!385, !304, !383, !1013, !382}
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfds_t", file: !1014, line: 33, baseType: !306)
!1014 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "")
!1015 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1016, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !1017, retainedTypes: !1059, splitDebugInlining: false, nameTableKind: None)
!1016 = !DIFile(filename: "simpleconf.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!1017 = !{!1018, !5, !1024, !1036}
!1018 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SimpleConfSpecialHandlerResult_", file: !771, line: 11, baseType: !7, size: 32, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023}
!1020 = !DIEnumerator(name: "SC_SPECIAL_HANDLER_RESULT_UNDEFINED", value: 0, isUnsigned: true)
!1021 = !DIEnumerator(name: "SC_SPECIAL_HANDLER_RESULT_NEXT", value: 1, isUnsigned: true)
!1022 = !DIEnumerator(name: "SC_SPECIAL_HANDLER_RESULT_ERROR", value: 2, isUnsigned: true)
!1023 = !DIEnumerator(name: "SC_SPECIAL_HANDLER_RESULT_INCLUDE", value: 3, isUnsigned: true)
!1024 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EntryResult_", file: !1016, line: 47, baseType: !7, size: 32, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035}
!1026 = !DIEnumerator(name: "ENTRYRESULT_UNDEFINED", value: 0, isUnsigned: true)
!1027 = !DIEnumerator(name: "ENTRYRESULT_OK", value: 1, isUnsigned: true)
!1028 = !DIEnumerator(name: "ENTRYRESULT_IGNORE", value: 2, isUnsigned: true)
!1029 = !DIEnumerator(name: "ENTRYRESULT_PROPNOTFOUND", value: 3, isUnsigned: true)
!1030 = !DIEnumerator(name: "ENTRYRESULT_MISMATCH", value: 4, isUnsigned: true)
!1031 = !DIEnumerator(name: "ENTRYRESULT_SYNTAX", value: 5, isUnsigned: true)
!1032 = !DIEnumerator(name: "ENTRYRESULT_INVALID_ENTRY", value: 6, isUnsigned: true)
!1033 = !DIEnumerator(name: "ENTRYRESULT_INTERNAL", value: 7, isUnsigned: true)
!1034 = !DIEnumerator(name: "ENTRYRESULT_E2BIG", value: 8, isUnsigned: true)
!1035 = !DIEnumerator(name: "ENTRYRESULT_SPECIAL", value: 9, isUnsigned: true)
!1036 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "State_", file: !1016, line: 17, baseType: !7, size: 32, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1038 = !DIEnumerator(name: "STATE_UNDEFINED", value: 0, isUnsigned: true)
!1039 = !DIEnumerator(name: "STATE_PROPNAME", value: 1, isUnsigned: true)
!1040 = !DIEnumerator(name: "STATE_AFTERPROPNAME", value: 2, isUnsigned: true)
!1041 = !DIEnumerator(name: "STATE_AFTERPROPNAME2", value: 3, isUnsigned: true)
!1042 = !DIEnumerator(name: "STATE_AFTERPROPNAMESEP", value: 4, isUnsigned: true)
!1043 = !DIEnumerator(name: "STATE_RCHAR", value: 5, isUnsigned: true)
!1044 = !DIEnumerator(name: "STATE_MATCH_ALPHA", value: 6, isUnsigned: true)
!1045 = !DIEnumerator(name: "STATE_MATCH_ALNUM", value: 7, isUnsigned: true)
!1046 = !DIEnumerator(name: "STATE_MATCH_DIGITS", value: 8, isUnsigned: true)
!1047 = !DIEnumerator(name: "STATE_MATCH_XDIGITS", value: 9, isUnsigned: true)
!1048 = !DIEnumerator(name: "STATE_MATCH_NOSPACE", value: 10, isUnsigned: true)
!1049 = !DIEnumerator(name: "STATE_MATCH_ANY", value: 11, isUnsigned: true)
!1050 = !DIEnumerator(name: "STATE_MATCH_ANY_WITHINQUOTES", value: 12, isUnsigned: true)
!1051 = !DIEnumerator(name: "STATE_MATCH_ANY_AFTERQUOTES", value: 13, isUnsigned: true)
!1052 = !DIEnumerator(name: "STATE_MATCH_ANY_WITHOUTQUOTES", value: 14, isUnsigned: true)
!1053 = !DIEnumerator(name: "STATE_MATCH_ANY_UNQUOTED", value: 15, isUnsigned: true)
!1054 = !DIEnumerator(name: "STATE_MATCH_SPACES", value: 16, isUnsigned: true)
!1055 = !DIEnumerator(name: "STATE_MATCH_BOOLEAN", value: 17, isUnsigned: true)
!1056 = !DIEnumerator(name: "STATE_TEMPLATE_UNDEFINED", value: 18, isUnsigned: true)
!1057 = !DIEnumerator(name: "STATE_TEMPLATE_RCHAR", value: 19, isUnsigned: true)
!1058 = !DIEnumerator(name: "STATE_TEMPLATE_SUBST_ESC", value: 20, isUnsigned: true)
!1059 = !{!303, !326, !7, !304, !1060, !385, !307, !321, !1061, !309}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!1063 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1064, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, splitDebugInlining: false, nameTableKind: None)
!1064 = !DIFile(filename: "utils.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!1065 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1066, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !1067, splitDebugInlining: false, nameTableKind: None)
!1066 = !DIFile(filename: "bsd-glob.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!1067 = !{!306, !303, !382, !1068, !1071, !1070, !1072, !383, !304, !1087, !493}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "Char", file: !1066, line: 98, baseType: !321)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!1075, !303}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !1077, line: 22, size: 2240, elements: !1078)
!1077 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!1078 = !{!1079, !1080, !1081, !1082, !1083}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1076, file: !1077, line: 25, baseType: !482, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1076, file: !1077, line: 26, baseType: !346, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1076, file: !1077, line: 31, baseType: !321, size: 16, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1076, file: !1077, line: 32, baseType: !307, size: 8, offset: 144)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1076, file: !1077, line: 33, baseType: !1084, size: 2048, offset: 152)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 2048, elements: !1085)
!1085 = !{!1086}
!1086 = !DISubrange(count: 256)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "glob_path_stat", file: !1066, line: 123, size: 128, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "gps_path", scope: !1089, file: !1066, line: 124, baseType: !308, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gps_stat", scope: !1089, file: !1066, line: 125, baseType: !1093, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1095, line: 46, size: 1152, elements: !1096)
!1095 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!1096 = !{!1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1108, !1110, !1117, !1118, !1119}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1094, file: !1095, line: 48, baseType: !478, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1094, file: !1095, line: 53, baseType: !482, size: 64, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1094, file: !1095, line: 61, baseType: !833, size: 64, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1094, file: !1095, line: 62, baseType: !349, size: 32, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1094, file: !1095, line: 64, baseType: !339, size: 32, offset: 224)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1094, file: !1095, line: 65, baseType: !360, size: 32, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1094, file: !1095, line: 67, baseType: !326, size: 32, offset: 288)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1094, file: !1095, line: 69, baseType: !478, size: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1094, file: !1095, line: 74, baseType: !346, size: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1094, file: !1095, line: 78, baseType: !1107, size: 64, offset: 448)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !313, line: 174, baseType: !334)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1094, file: !1095, line: 80, baseType: !1109, size: 64, offset: 512)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !313, line: 179, baseType: !334)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1094, file: !1095, line: 91, baseType: !1111, size: 128, offset: 576)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1112, line: 10, size: 128, elements: !1113)
!1112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1111, file: !1112, line: 12, baseType: !333, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1111, file: !1112, line: 16, baseType: !1116, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !313, line: 196, baseType: !334)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1094, file: !1095, line: 92, baseType: !1111, size: 128, offset: 704)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1094, file: !1095, line: 93, baseType: !1111, size: 128, offset: 832)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1094, file: !1095, line: 106, baseType: !1120, size: 192, offset: 960)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 192, elements: !1121)
!1121 = !{!1122}
!1122 = !DISubrange(count: 3)
!1123 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1124, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !471, retainedTypes: !1125, splitDebugInlining: false, nameTableKind: None)
!1124 = !DIFile(filename: "daemons.c", directory: "/home/songxiangpu/Documents/protocol_implementation/pure-ftpd/src")
!1125 = !{!326, !304, !383, !306}
!1126 = !{!"clang version 10.0.0-4ubuntu1 "}
!1127 = !{i32 7, !"Dwarf Version", i32 4}
!1128 = !{i32 2, !"Debug Info Version", i32 3}
!1129 = !{i32 1, !"wchar_size", i32 4}
!1130 = !{i32 7, !"PIC Level", i32 2}
!1131 = !{i32 7, !"PIE Level", i32 2}
!1132 = distinct !DISubprogram(name: "main", scope: !972, file: !972, line: 4, type: !1133, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !971, retainedNodes: !471)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!326, !326, !493}
!1135 = !DILocalVariable(name: "argc", arg: 1, scope: !1132, file: !972, line: 4, type: !326)
!1136 = !DILocation(line: 4, column: 14, scope: !1132)
!1137 = !DILocalVariable(name: "argv", arg: 2, scope: !1132, file: !972, line: 4, type: !493)
!1138 = !DILocation(line: 4, column: 26, scope: !1132)
!1139 = !DILocation(line: 6, column: 27, scope: !1132)
!1140 = !DILocation(line: 6, column: 33, scope: !1132)
!1141 = !DILocation(line: 6, column: 12, scope: !1132)
!1142 = !DILocation(line: 6, column: 5, scope: !1132)
!1143 = distinct !DISubprogram(name: "disablesignals", scope: !3, file: !3, line: 51, type: !486, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !471)
!1144 = !DILocalVariable(name: "sigs", scope: !1143, file: !3, line: 53, type: !500)
!1145 = !DILocation(line: 53, column: 14, scope: !1143)
!1146 = !DILocation(line: 55, column: 5, scope: !1143)
!1147 = !DILocation(line: 56, column: 9, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 56, column: 9)
!1149 = !DILocation(line: 56, column: 53, scope: !1148)
!1150 = !DILocation(line: 56, column: 9, scope: !1143)
!1151 = !DILocation(line: 57, column: 9, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1148, file: !3, line: 56, column: 58)
!1153 = !DILocation(line: 59, column: 1, scope: !1143)
!1154 = distinct !DISubprogram(name: "_EXIT", scope: !3, file: !3, line: 299, type: !803, scopeLine: 300, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !471)
!1155 = !DILocalVariable(name: "status", arg: 1, scope: !1154, file: !3, line: 299, type: !731)
!1156 = !DILocation(line: 299, column: 22, scope: !1154)
!1157 = !DILocation(line: 301, column: 5, scope: !1154)
!1158 = !DILocation(line: 305, column: 11, scope: !1154)
!1159 = !DILocation(line: 305, column: 5, scope: !1154)
!1160 = distinct !DISubprogram(name: "delete_atomic_file", scope: !3, file: !3, line: 3699, type: !486, scopeLine: 3700, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !471)
!1161 = !DILocalVariable(name: "atomic_file", scope: !1160, file: !3, line: 3701, type: !385)
!1162 = !DILocation(line: 3701, column: 17, scope: !1160)
!1163 = !DILocation(line: 3703, column: 24, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 3703, column: 9)
!1165 = !DILocation(line: 3703, column: 22, scope: !1164)
!1166 = !DILocation(line: 3703, column: 47, scope: !1164)
!1167 = !DILocation(line: 3703, column: 55, scope: !1164)
!1168 = !DILocation(line: 3703, column: 59, scope: !1164)
!1169 = !DILocation(line: 3703, column: 58, scope: !1164)
!1170 = !DILocation(line: 3703, column: 71, scope: !1164)
!1171 = !DILocation(line: 3703, column: 9, scope: !1160)
!1172 = !DILocation(line: 3704, column: 9, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 3703, column: 77)
!1174 = !DILocation(line: 3707, column: 17, scope: !1160)
!1175 = !DILocation(line: 3708, column: 1, scope: !1160)
!1176 = !DILocalVariable(name: "file", arg: 1, scope: !738, file: !3, line: 3663, type: !529)
!1177 = !DILocation(line: 3663, column: 49, scope: !738)
!1178 = !DILocalVariable(name: "z", scope: !738, file: !3, line: 3666, type: !308)
!1179 = !DILocation(line: 3666, column: 11, scope: !738)
!1180 = !DILocalVariable(name: "orig_len", scope: !738, file: !3, line: 3667, type: !304)
!1181 = !DILocation(line: 3667, column: 12, scope: !738)
!1182 = !DILocalVariable(name: "slash", scope: !738, file: !3, line: 3668, type: !304)
!1183 = !DILocation(line: 3668, column: 12, scope: !738)
!1184 = !DILocalVariable(name: "sizeof_atomic_prefix", scope: !738, file: !3, line: 3669, type: !304)
!1185 = !DILocation(line: 3669, column: 12, scope: !738)
!1186 = !DILocation(line: 3671, column: 9, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !738, file: !3, line: 3671, column: 9)
!1188 = !DILocation(line: 3671, column: 14, scope: !1187)
!1189 = !DILocation(line: 3671, column: 9, scope: !738)
!1190 = !DILocation(line: 3672, column: 9, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 3671, column: 23)
!1192 = !DILocation(line: 3674, column: 22, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !738, file: !3, line: 3674, column: 9)
!1194 = !DILocation(line: 3674, column: 14, scope: !1193)
!1195 = !DILocation(line: 3674, column: 12, scope: !1193)
!1196 = !DILocation(line: 3674, column: 34, scope: !1193)
!1197 = !DILocation(line: 3674, column: 9, scope: !738)
!1198 = !DILocation(line: 3675, column: 14, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 3674, column: 43)
!1200 = !DILocation(line: 3676, column: 18, scope: !1199)
!1201 = !DILocation(line: 3677, column: 5, scope: !1199)
!1202 = !DILocation(line: 3678, column: 27, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 3677, column: 12)
!1204 = !DILocation(line: 3678, column: 31, scope: !1203)
!1205 = !DILocation(line: 3678, column: 29, scope: !1203)
!1206 = !DILocation(line: 3678, column: 15, scope: !1203)
!1207 = !DILocation(line: 3679, column: 13, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 3679, column: 13)
!1209 = !DILocation(line: 3679, column: 19, scope: !1208)
!1210 = !DILocation(line: 3679, column: 13, scope: !1203)
!1211 = !DILocation(line: 3680, column: 13, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1208, file: !3, line: 3679, column: 50)
!1213 = !DILocation(line: 3682, column: 14, scope: !1203)
!1214 = !DILocation(line: 3683, column: 13, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 3683, column: 13)
!1216 = !DILocation(line: 3683, column: 18, scope: !1215)
!1217 = !DILocation(line: 3683, column: 25, scope: !1215)
!1218 = !DILocation(line: 3683, column: 13, scope: !1203)
!1219 = !DILocation(line: 3684, column: 13, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1215, file: !3, line: 3683, column: 31)
!1221 = !DILocation(line: 3686, column: 22, scope: !1203)
!1222 = !DILocation(line: 3686, column: 28, scope: !1203)
!1223 = !DILocation(line: 3686, column: 9, scope: !1203)
!1224 = !DILocation(line: 3687, column: 13, scope: !1203)
!1225 = !DILocation(line: 3687, column: 9, scope: !1203)
!1226 = !DILocation(line: 3687, column: 20, scope: !1203)
!1227 = !DILocation(line: 3688, column: 20, scope: !1203)
!1228 = !DILocation(line: 3688, column: 18, scope: !1203)
!1229 = !DILocation(line: 3690, column: 35, scope: !738)
!1230 = !DILocation(line: 3690, column: 28, scope: !738)
!1231 = !DILocation(line: 3690, column: 50, scope: !738)
!1232 = !DILocation(line: 3690, column: 26, scope: !738)
!1233 = !DILocation(line: 3691, column: 22, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !738, file: !3, line: 3691, column: 9)
!1235 = !DILocation(line: 3691, column: 20, scope: !1234)
!1236 = !DILocation(line: 3691, column: 33, scope: !1234)
!1237 = !DILocation(line: 3691, column: 31, scope: !1234)
!1238 = !DILocation(line: 3691, column: 9, scope: !738)
!1239 = !DILocation(line: 3692, column: 9, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1234, file: !3, line: 3691, column: 55)
!1241 = !DILocation(line: 3694, column: 18, scope: !738)
!1242 = !DILocation(line: 3694, column: 16, scope: !738)
!1243 = !DILocation(line: 3694, column: 28, scope: !738)
!1244 = !DILocation(line: 3694, column: 43, scope: !738)
!1245 = !DILocation(line: 3694, column: 5, scope: !738)
!1246 = !DILocation(line: 3696, column: 5, scope: !738)
!1247 = !DILocation(line: 3697, column: 1, scope: !738)
!1248 = distinct !DISubprogram(name: "usleep2", scope: !3, file: !3, line: 68, type: !1249, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !471)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{null, !1251}
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!1252 = !DILocalVariable(name: "microsec", arg: 1, scope: !1248, file: !3, line: 68, type: !1251)
!1253 = !DILocation(line: 68, column: 34, scope: !1248)
!1254 = !DILocation(line: 73, column: 1, scope: !1248)
!1255 = distinct !DISubprogram(name: "simplify", scope: !3, file: !3, line: 192, type: !469, scopeLine: 193, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !471)
!1256 = !DILocalVariable(name: "subdir", arg: 1, scope: !1255, file: !3, line: 192, type: !308)
!1257 = !DILocation(line: 192, column: 21, scope: !1255)
!1258 = !DILocalVariable(name: "a", scope: !1255, file: !3, line: 194, type: !308)
!1259 = !DILocation(line: 194, column: 11, scope: !1255)
!1260 = !DILocation(line: 196, column: 9, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1255, file: !3, line: 196, column: 9)
!1262 = !DILocation(line: 196, column: 16, scope: !1261)
!1263 = !DILocation(line: 196, column: 24, scope: !1261)
!1264 = !DILocation(line: 196, column: 28, scope: !1261)
!1265 = !DILocation(line: 196, column: 27, scope: !1261)
!1266 = !DILocation(line: 196, column: 35, scope: !1261)
!1267 = !DILocation(line: 196, column: 9, scope: !1255)
!1268 = !DILocation(line: 197, column: 9, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1261, file: !3, line: 196, column: 41)
!1270 = !DILocation(line: 199, column: 5, scope: !1255)
!1271 = !DILocation(line: 199, column: 24, scope: !1255)
!1272 = !DILocation(line: 199, column: 17, scope: !1255)
!1273 = !DILocation(line: 199, column: 15, scope: !1255)
!1274 = !DILocation(line: 199, column: 39, scope: !1255)
!1275 = !DILocation(line: 200, column: 20, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1255, file: !3, line: 199, column: 48)
!1277 = !DILocation(line: 200, column: 23, scope: !1276)
!1278 = !DILocation(line: 200, column: 25, scope: !1276)
!1279 = !DILocation(line: 200, column: 9, scope: !1276)
!1280 = distinct !{!1280, !1270, !1281}
!1281 = !DILocation(line: 201, column: 5, scope: !1255)
!1282 = !DILocation(line: 202, column: 5, scope: !1255)
!1283 = !DILocation(line: 202, column: 24, scope: !1255)
!1284 = !DILocation(line: 202, column: 17, scope: !1255)
!1285 = !DILocation(line: 202, column: 15, scope: !1255)
!1286 = !DILocation(line: 202, column: 40, scope: !1255)
!1287 = !DILocation(line: 203, column: 20, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1255, file: !3, line: 202, column: 49)
!1289 = !DILocation(line: 203, column: 23, scope: !1288)
!1290 = !DILocation(line: 203, column: 25, scope: !1288)
!1291 = !DILocation(line: 203, column: 9, scope: !1288)
!1292 = distinct !{!1292, !1282, !1293}
!1293 = !DILocation(line: 204, column: 5, scope: !1255)
!1294 = !DILocation(line: 205, column: 5, scope: !1255)
!1295 = !DILocation(line: 205, column: 20, scope: !1255)
!1296 = !DILocation(line: 205, column: 12, scope: !1255)
!1297 = !DILocation(line: 205, column: 38, scope: !1255)
!1298 = !DILocation(line: 206, column: 16, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1255, file: !3, line: 205, column: 44)
!1300 = distinct !{!1300, !1294, !1301}
!1301 = !DILocation(line: 207, column: 5, scope: !1255)
!1302 = !DILocation(line: 208, column: 16, scope: !1255)
!1303 = !DILocation(line: 208, column: 9, scope: !1255)
!1304 = !DILocation(line: 208, column: 7, scope: !1255)
!1305 = !DILocation(line: 209, column: 9, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1255, file: !3, line: 209, column: 9)
!1307 = !DILocation(line: 209, column: 11, scope: !1306)
!1308 = !DILocation(line: 209, column: 9, scope: !1255)
!1309 = !DILocation(line: 210, column: 13, scope: !1310)
!1310 = distinct !DILexicalBlock(scope: !1311, file: !3, line: 210, column: 13)
!1311 = distinct !DILexicalBlock(scope: !1306, file: !3, line: 209, column: 20)
!1312 = !DILocation(line: 210, column: 18, scope: !1310)
!1313 = !DILocation(line: 210, column: 15, scope: !1310)
!1314 = !DILocation(line: 210, column: 13, scope: !1311)
!1315 = !DILocation(line: 211, column: 13, scope: !1316)
!1316 = distinct !DILexicalBlock(scope: !1310, file: !3, line: 210, column: 26)
!1317 = !DILocation(line: 211, column: 28, scope: !1316)
!1318 = !DILocation(line: 211, column: 20, scope: !1316)
!1319 = !DILocation(line: 211, column: 47, scope: !1316)
!1320 = !DILocation(line: 212, column: 28, scope: !1321)
!1321 = distinct !DILexicalBlock(scope: !1316, file: !3, line: 211, column: 53)
!1322 = !DILocation(line: 212, column: 36, scope: !1321)
!1323 = !DILocation(line: 212, column: 43, scope: !1321)
!1324 = !DILocation(line: 212, column: 17, scope: !1321)
!1325 = distinct !{!1325, !1315, !1326}
!1326 = !DILocation(line: 213, column: 13, scope: !1316)
!1327 = !DILocation(line: 214, column: 24, scope: !1316)
!1328 = !DILocation(line: 214, column: 17, scope: !1316)
!1329 = !DILocation(line: 214, column: 15, scope: !1316)
!1330 = !DILocation(line: 215, column: 9, scope: !1316)
!1331 = !DILocation(line: 216, column: 9, scope: !1311)
!1332 = !DILocation(line: 216, column: 16, scope: !1311)
!1333 = !DILocation(line: 216, column: 18, scope: !1311)
!1334 = !DILocalVariable(name: "nextcomponent", scope: !1335, file: !3, line: 217, type: !308)
!1335 = distinct !DILexicalBlock(scope: !1311, file: !3, line: 216, column: 27)
!1336 = !DILocation(line: 217, column: 19, scope: !1335)
!1337 = !DILocation(line: 217, column: 35, scope: !1335)
!1338 = !DILocation(line: 217, column: 37, scope: !1335)
!1339 = !DILocation(line: 218, column: 17, scope: !1340)
!1340 = distinct !DILexicalBlock(scope: !1335, file: !3, line: 218, column: 17)
!1341 = !DILocation(line: 218, column: 22, scope: !1340)
!1342 = !DILocation(line: 218, column: 19, scope: !1340)
!1343 = !DILocation(line: 218, column: 29, scope: !1340)
!1344 = !DILocation(line: 218, column: 33, scope: !1340)
!1345 = !DILocation(line: 218, column: 32, scope: !1340)
!1346 = !DILocation(line: 218, column: 35, scope: !1340)
!1347 = !DILocation(line: 218, column: 17, scope: !1335)
!1348 = !DILocation(line: 219, column: 18, scope: !1349)
!1349 = distinct !DILexicalBlock(scope: !1340, file: !3, line: 218, column: 43)
!1350 = !DILocation(line: 220, column: 13, scope: !1349)
!1351 = !DILocation(line: 221, column: 13, scope: !1335)
!1352 = !DILocation(line: 221, column: 20, scope: !1335)
!1353 = !DILocation(line: 221, column: 25, scope: !1335)
!1354 = !DILocation(line: 221, column: 22, scope: !1335)
!1355 = !DILocation(line: 221, column: 32, scope: !1335)
!1356 = !DILocation(line: 221, column: 36, scope: !1335)
!1357 = !DILocation(line: 221, column: 35, scope: !1335)
!1358 = !DILocation(line: 221, column: 38, scope: !1335)
!1359 = !DILocation(line: 0, scope: !1335)
!1360 = !DILocation(line: 222, column: 18, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1335, file: !3, line: 221, column: 46)
!1362 = distinct !{!1362, !1351, !1363}
